Documents/НаправлениеНаМедицинскийОсмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НаправлениеНаМедицинскийОсмотр</Name>
			<BasedOn>
				<xr:Item>Document.РешениеОПриемеНаРаботу</xr:Item>
				<xr:Item>Document.РешениеОКадровомПереводе</xr:Item>
				<xr:Item>Catalog.Кандидаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистПоОхранеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСпециалистаПоОхранеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиСпециалистаПоОхранеТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаОМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаДМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторыИВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ВыданныеНаправленияНаМедицинскийОсмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыданныеНаправленияНаМедицинскийОсмотр</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НаправлениеНаМедицинскийОсмотр</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заключение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внеплановый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РабочиеМестаОхраныТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеРабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредныеФакторыСопоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормыСИЗСоответствуютДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальноеРабочееМестоДляИнвалидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НаправлениеНаМедицинскийОсмотр/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если Метаданные.ОпределяемыеТипы.ОснованиеНаправленияНаМедицинскийОсмотр.Тип.СодержитТип(ТипДанныхЗаполнения) Тогда
		ДанныеЗаполнения = Документы.НаправлениеНаМедицинскийОсмотр.ДанныеЗаполненияПоОснованию(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Ссылка) И МедицинскиеОсмотры.ЕстьЗаключениеПоНаправлению(Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'По данному направлению уже введено заключение медицинского осмотра'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	ДатаНаправления = ДатаОсмотра;
	Если Не ЗначениеЗаполнено(ДатаНаправления) Тогда
		ДатаНаправления = Дата;
	КонецЕсли;
	
	Если ДатаНаправления >= МедицинскиеОсмотры.ДатаПриказа29н() Или ВредныеФакторыИВидыРабот.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидыРабот");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВредныеФакторы");
	Иначе	
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВредныеФакторыИВидыРабот");
		Если ВредныеФакторы.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидыРабот");
		КонецЕсли;
		
		Если ВидыРабот.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВредныеФакторы");
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И МедицинскиеОсмотры.ЕстьЗаключениеПоНаправлению(Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'По данному направлению уже введено заключение медицинского осмотра'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВредныеФакторыИВидыРабот", "ВредныйФактор");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВредныеФакторы", "ВредныйФактор");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВидыРабот", "ВидРабот");
	
	ДанныеРабочегоМеста = Справочники.РабочиеМестаОхраныТруда.ДанныеРабочегоМеста(РабочееМесто);
	Если ДанныеРабочегоМеста = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Подразделение = ДанныеРабочегоМеста.Подразделение;
	Должность = ДанныеРабочегоМеста.Должность;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьВыданноеНаправление();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВредныеФакторыВидыРабот() Экспорт
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ВредныеФакторыИВидыРабот.Очистить();
		ВредныеФакторы.Очистить();
		ВидыРабот.Очистить();
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности = МедицинскиеОсмотры.ДатаАктуальностиДляЗаполненияНаправленияНаМедицинскийОсмотр(Дата, Организация);
	ЗаполнятьТолькоАктуальными = ТипОсмотра = Перечисления.ТипыМедицинскогоОсмотра.Периодический;
	
	ВредныеФакторыИВидыРаботТаблица = МедицинскиеОсмотры.ВредныеФакторыИВидыРаботТребующиеОсмотра(
		ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности, ЗаполнятьТолькоАктуальными);
	ВредныеФакторыИВидыРабот.Загрузить(ВредныеФакторыИВидыРаботТаблица);
	
	ВредныеФакторыТаблица = МедицинскиеОсмотры.ВредныеФакторыТребующиеОсмотра(
		ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности, ЗаполнятьТолькоАктуальными);
	ВредныеФакторы.Загрузить(ВредныеФакторыТаблица);
	
	ВидыРаботТаблица = МедицинскиеОсмотры.ВидыРаботТребующиеОсмотра(
		ФизическоеЛицо, ВидОсмотра, РабочееМесто, ДатаАктуальности, ЗаполнятьТолькоАктуальными);
	ВидыРабот.Загрузить(ВидыРаботТаблица);
	
КонецПроцедуры

Процедура ЗаполнитьДатуРожденияФизическогоЛица() Экспорт
	
	ДатаРождения = Неопределено;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическиеЛица, "ДатаРождения");
	
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРождения = КадровыеДанные[0]["ДатаРождения"];
	
КонецПроцедуры

Процедура ЗаполнитьРабочееМесто() Экспорт
	
	РабочееМесто = Неопределено;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыЗапроса.КадровыеДанные = "РабочееМестоОхраныТруда";
	ПараметрыЗапроса.Организация = Организация;
	ПараметрыЗапроса.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ОформленПоТрудовомуДоговору", "=", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыЗапроса.Отборы, "ДатаУвольнения", "=", "ДАТАВРЕМЯ(1, 1, 1)");
	
	КадровыеДанные = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыЗапроса);
	Если КадровыеДанные.Количество() = 0 Тогда
		РабочееМесто = Неопределено;
		Возврат;
	КонецЕсли;
	
	РабочееМесто = КадровыеДанные[0].РабочееМестоОхраныТруда;
	
	ЗаполнитьВредныеФакторыВидыРабот();
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
	Если Не ЗначениеЗаполнено(ВидОсмотра) Тогда
		ВидОсмотра = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаписатьВыданноеНаправление()
	
	// Определим предыдущее состояние регистра по этому направлению.
	ДанныеНаправления = РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.ДанныеВыданногоНаправления(Ссылка);
	
	// Удаляем прежние данные.
	Для Каждого Выборка Из ДанныеНаправления Цикл
		НаборЗаписей = РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.РабочееМесто.Установить(Выборка.РабочееМесто);
		НаборЗаписей.Отбор.ВидОсмотра.Установить(Выборка.ВидОсмотра);
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		Если ПометкаУдаления Или Выборка.ФизическоеЛицо <> ФизическоеЛицо Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПрежнийНабор", ДанныеНаправления);
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем новую запись о выданном направлении.
	ДатаЗаписи = ДатаОсмотра;
	Если Не ЗначениеЗаполнено(ДатаЗаписи) Тогда
		ДатаЗаписи = Дата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) 
		Или Не ЗначениеЗаполнено(РабочееМесто) 
		Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ВыданныеНаправленияНаМедицинскийОсмотр.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	НаборЗаписей.Отбор.РабочееМесто.Установить(РабочееМесто);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
	НаборЗаписей.Отбор.Период.Установить(ДатаЗаписи);
	
	СтрокаНабора = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаНабора, ЭтотОбъект);
	СтрокаНабора.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	СтрокаНабора.Период = ДатаЗаписи;
	СтрокаНабора.Направление = Ссылка;
	СтрокаНабора.Заключение = МедицинскиеОсмотры.ЗаключениеПоНаправлению(Ссылка);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПрежнийНабор", ДанныеНаправления);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполнитьДатуРожденияФизическогоЛица();
	ЗаполнитьЗначенияПоУмолчанию();
	
	РабочееМесто = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "РабочееМесто");
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ЗаполнитьРабочееМесто();
	Иначе
		ЗаполнитьВредныеФакторыВидыРабот();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
